public/extend-root-space.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" /
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org6bc7e28" class="outline-2">
<h2 id="org6bc7e28">Extending the root partition's space from the home partition with the fdisk</h2>
<div class="outline-text-2" id="text-org6bc7e28">
<p>
起初在安装 <code>GNU/Linux</code> 的时候由于采用系统默认的磁盘分割，
导致我的这块只有 <code>120G</code> 的磁盘其 <code>root</code> 对应的分区只有可怜的 <code>20G</code> ， 于是最近在安装一些软件包的时候存放二进制文件的 <code>/usr/bin</code> 目录空间不够，很是苦恼。
本来想着删除掉一些根目录下的缓存文件，
或着卸载几个不常用的软件包，但发现家目录 <code>(/home)</code> 居然占了整个
磁盘的 <code>3/4</code> 之多 ，那就不如从 <code>/home</code> 对应的分区腾出一部分空间来扩展到
<code>/</code> 对应的分区。
</p>
</div>

<div id="outline-container-org9f3b109" class="outline-3">
<h3 id="org9f3b109">做好 /home 的备份</h3>
<div class="outline-text-3" id="text-org9f3b109">
<p>
首先， <code>/home</code> 目录存放了大量的用户配置以及一些文件数据，有些是很重要的，
如果不想重装系统，一定要做好备份！（系统重装是一件极其耗费时间和精力的事，尽管
我曾作为一个 <code>Linux</code> 菜鸟做过很多重装的事，配置起一个看起来还算不错的系统！）
我看了一下我的 <code>/home</code> 目录其 <code>90G</code> 的磁盘，所有的数据加起来才一共占到
<code>13</code> 个 G 左右，但是 <code>/root</code> 所占的数据已经 <code>96%</code> 之多了，那么备份到
<code>/root</code> 目录下不可能，即使用压缩也不行。幸好我有第二块磁盘可供使用，那么
就用这块磁盘来做 <code>/home</code>  数据的备份。
</p>

<div class="org-src-container">
<pre class="src src-shell">tar -czvf /your_back_up_disk/home.trz -C /home .
</pre>
</div>

<p>
这个过程可能需要点时间，看你的文件大小，以及是否是机械磁盘，不过我大概等了 <code>7,8</code> 分钟，而且我的备份磁盘还是机械盘。完成这一步骤接下来的几个部分
一定要非常仔细且认真，因为稍有不慎会将整个系统格式化。
</p>
</div>
</div>

<div id="outline-container-org4e2f506" class="outline-3">
<h3 id="org4e2f506">小心驶得万年船</h3>
<div class="outline-text-3" id="text-org4e2f506">
<p>
重启系统，以 <code>/root</code> 权限，并以 <code>tty0/1</code> 登陆，因为如果继续在当前用户环境下操作，
由于某些程序需要读取 <code>/home</code> 中的文件，系统就可能会处于繁忙状态而无法操作。
</p>
</div>
<div id="outline-container-orgbd4e8db" class="outline-4">
<h4 id="orgbd4e8db">查看当前系统盘信息</h4>
<div class="outline-text-4" id="text-orgbd4e8db">
<div class="org-src-container">
<pre class="src src-shell">fdisk -l
</pre>
</div>

<p>
确定好当前系统是哪一个盘符下，类似如下输出：
</p>
<div class="org-src-container">
<pre class="src src-shell">Disk /dev/sda: 119.24 GiB, 128035676160 bytes
...
  Device      Start       End   Sectors  Size Type
/dev/sda1      2048   1048575   1046528  511M EFI System
/dev/sda2   1050624  84936703  83886080   40G Linux filesystem
/dev/sda3  84936704 250068991 165132288 78.7G Linux filesystem
</pre>
</div>

<p>
例如我的根 <code>/</code> 目录对应的磁盘分区是 <code>/dev/sda2</code> ， 而 <code>/dev/sda3</code> 磁盘分区被挂载到了 <code>/home</code> 目录，可以通过如下命令确定：
</p>
<div class="org-src-container">
<pre class="src src-shell">df -h
</pre>
</div>
<p>
类似的输出如下：
</p>
<div class="org-src-container">
<pre class="src src-shell">Filesystem       Size  Used Avail Use% Mounted on
 /dev/sda2        40G   19G   20G  49% /
 /dev/sda3        77G   15G   59G  21% /home
 /dev/sda1       510M   72M  439M  14% /boot
</pre>
</div>
</div>
</div>
<div id="outline-container-orge88ed57" class="outline-4">
<h4 id="orge88ed57">进行分区操作</h4>
<div class="outline-text-4" id="text-orge88ed57">
<p>
接下来的操作一定要谨慎！
</p>

<p>
首先卸载 <code>/home</code> 目录对应的分区， 例如我的 <code>/home</code> 目录对应 <code>/dev/sda3</code> 。
</p>
<div class="org-src-container">
<pre class="src src-shell">umount /dev/sda3
</pre>
</div>

<p>
完成上一步，接下来就是正式扩容了：
</p>
<div class="org-src-container">
<pre class="src src-shell">fdisk /dev/sda
</pre>
</div>

<p>
使用 <code>fdisk</code> 命令进行磁盘的扩容。 <code>fdisk</code>
磁盘操作命令非常简单，你只需要键入一个字母以及根据命令的提示
输入参数就可以完成磁盘的扩容。
</p>
<div class="org-src-container">
<pre class="src src-shell">Command (m for help):
</pre>
</div>
<p>
接着输入 <code>p</code> 查看当前系统盘下的磁盘分割信息，类似如下输出：
</p>
<div class="org-src-container">
<pre class="src src-shell">  Device      Start       End   Sectors  Size Type
/dev/sda1      2048   1048575   1046528  511M EFI System
/dev/sda2   1050624  84936703  83886080   40G Linux filesystem
/dev/sda3  84936704 250068991 165132288 78.7G Linux filesystem
</pre>
</div>

<p>
可以看到命令 <code>p</code> 与终端命令 <code>fdisk -l</code> 输出的结果一样。
我们首先删除 <code>/home</code> 对应的磁盘分区 <code>/dev/sda3</code> ， 使用命令
<code>d</code> ，类似输出如下：
</p>
<div class="org-src-container">
<pre class="src src-shell">Command (m for help): d
Partition number (1-3, default 3):
</pre>
</div>
<p>
这时候它提示你要删除的分区是哪一个， <code>fdisk</code> 会为每一个逻辑分区编一个号，
比如 <code>/boot</code> 分区从 <code>2048</code> 号扇区位起始到 <code>1048575</code> 号扇区位结束为 <code>number1</code> ，
从 <code>1050624</code> 号扇区位开始到 <code>84936703</code> 号扇区位结束为 <code>number2</code> ， 以此类推， 可以
看到每一个分区的顺序是按照当初磁盘分割时的逻辑顺序排列的。
好了， 由于我的 <code>/home</code> 目录对应 <code>/de/sda3</code> 分区， 所以输入数字 <code>3</code> ，
然后再输入 <code>w</code> 命令进行写入并保存退出（这时候你的 <code>/home</code> 下的所有数据都被清空，
但是我们已经及时做好了备份）。
</p>

<p>
接着我们再次使用 <code>fdisk</code> 命令进行下一步的操作：
</p>
<div class="org-src-container">
<pre class="src src-shell">fdisk /dev/sda
</pre>
</div>
<p>
输入 <code>p</code> 查看当前分区：
</p>
<div class="org-src-container">
<pre class="src src-shell">  Command (m for help): p
  Device      Start       End   Sectors  Size Type
/dev/sda1      2048   1048575   1046528  511M EFI System
/dev/sda2   1050624  84936703  83886080   40G Linux filesystem
</pre>
</div>
<p>
可以看到我们已经将 <code>/home</code> 目录所对应的 <code>/dev/sda3</code> 分区删除，
接下来进行 <code>/</code> 对应的 <code>/dev/sda2</code> 分区进行扩容， 记住 <code>/dev/sda2</code>
的起始位是 <code>1050624</code> 。
</p>

<p>
继续输入 <code>d</code> 命令， 删除 <code>/</code> 目录对应的 <code>/dev/sda2</code> ， 这时候不要保存(切记!)
输入 <code>n</code> 命令， 创建新的分区(也就是扩容 <code>/</code>)， 类似如下输出：
</p>
<div class="org-src-container">
<pre class="src src-shell">Command (m for help): n
Partition number (2-128, default 2): 2
First sector (34-250069646, default 1048576):
</pre>
</div>
<p>
起始位置位输入原本 <code>/dev/sda2</code> 的 <code>Start</code> ， 也就是 <code>1050624</code> ，
类似如下输出：
</p>
<div class="org-src-container">
<pre class="src src-shell">Last sector, +/-sectors or +/-size{K,M,G,T,P} (1048576-1050623, default 1050623):
</pre>
</div>
<p>
接着提示你输入 <code>sectors/size</code> ， 可以是扇区位也可以输入大小， 注意这里我们是要扩容 <code>/</code> ， 所以我们应该输入比 <code>/</code> 原本 <code>20G</code> 还要大的值，
至少不能小于 <code>20G</code> ， 具体来说不能在它的结束位 <code>End</code> 以内。  这里我输入的命令值是 <code>+40G</code> ， 接着再重新创建 <code>/home</code> 目录的分区，
继续输入 <code>n</code> ， 如果你想把剩余的空间都给 <code>/home</code> ， 接下来所有的都可以默认， <code>enter</code> 一步步执行。
确认一切没问题之后， 输入 <code>w</code> 保存并退出。
</p>
</div>
</div>

<div id="outline-container-orge3b2040" class="outline-4">
<h4 id="orge3b2040">对扩容的分区进行最后一步操作</h4>
<div class="outline-text-4" id="text-orge3b2040">
<p>
接下来还要对 <code>/</code> 的分区进行文件系统的写入：
</p>
<div class="org-src-container">
<pre class="src src-shell">resize2fs /dev/sda2
</pre>
</div>
<p>
注意， 如果你原来的 <code>/dev/sda2</code> 文件系统是 <code>ext*</code> 格式， 那么使用以上命令没问题，
但如果是 <code>xfs</code> 请使用 <code>xfs_growfs /dev/sda2</code> 。
</p>
</div>
</div>

<div id="outline-container-orgc7b26f7" class="outline-4">
<h4 id="orgc7b26f7">恢复 /home 目录</h4>
<div class="outline-text-4" id="text-orgc7b26f7">
<p>
最后一步从备份中恢复 <code>/home</code> 目录中的所有文件， 首先为 <code>/dev/sda3</code> 写入文件系统，
由于我使用的是 <code>ext4</code> ， 所以输入以下命令：
</p>
<div class="org-src-container">
<pre class="src src-shell">mkfs.ext4 /dev/sda3
</pre>
</div>

<p>
从备份中恢复数据到 <code>/home</code> ：
</p>
<div class="org-src-container">
<pre class="src src-shell">tar -xzvf /your_back_up/home.trz -C /home
</pre>
</div>
<p>
如果一切顺利重启计算机。
</p>
</div>
</div>
</div>

<div id="outline-container-org99f075e" class="outline-3">
<h3 id="org99f075e">重启计算机</h3>
<div class="outline-text-3" id="text-org99f075e">
<p>
输入用户账号登陆， 进入桌面系统， 一切又是当初的模样！
</p>

<p>
<a href="./index.html">&lt;&#x2013; Back to Home</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
